In [1]:
!pip install pandas

Collecting pandas
  Downloading pandas-2.3.2-cp310-cp310-win_amd64.whl (11.3 MB)
     --------------------------------------- 11.3/11.3 MB 65.5 MB/s eta 0:00:00
Collecting pytz>=2020.1
  Downloading pytz-2025.2-py2.py3-none-any.whl (509 kB)
     ---------------------------------------- 509.2/509.2 kB ? eta 0:00:00
Collecting tzdata>=2022.7
  Downloading tzdata-2025.2-py2.py3-none-any.whl (347 kB)
     ---------------------------------------- 347.8/347.8 kB ? eta 0:00:00
Requirement already satisfied: numpy>=1.22.4 in c:\users\lemur\desktop\szkolenie_comarch\kod\.venv\lib\site-packages (from pandas) (2.2.6)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\lemur\desktop\szkolenie_comarch\kod\.venv\lib\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: six>=1.5 in c:\users\lemur\desktop\szkolenie_comarch\kod\.venv\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.17.0)
Installing collected packages: pytz, tzdata, pandas
Successfully installed pandas-2.3.2 pytz-2025.2 tzdata-2025.2

[notice] A new release of pip available: 22.2.2 -> 25.2
[notice] To update, run: python.exe -m pip install --upgrade pip

In [2]:
import pandas as pd

In [5]:
pd.Series([1,"abc", 2,4,5])

0      1
1    abc
2      2
3      4
4      5
dtype: object

In [8]:
df = pd.DataFrame(

    {
        "imie": ["Anna", "Jan", "Karol"],
        "wiek": [20, 40, 23],
        "miasto": ["Kraków", "Warszawa", "Poznań"],
        "pensja": [5_000, 10_000, 7_500]
    }

)

df

    imie  wiek    miasto  pensja
0   Anna    20    Kraków    5000
1    Jan    40  Warszawa   10000
2  Karol    23    Poznań    7500

In [10]:
print(df)

    imie  wiek    miasto  pensja
0   Anna    20    Kraków    5000
1    Jan    40  Warszawa   10000
2  Karol    23    Poznań    7500

In [11]:
# pd.set_option()

In [12]:
df = pd.DataFrame(
    [
        {
            "imie": "Anna",
            "wiek": 20, 
            "miasto": "Kraków", 
            "pensja": 5_000
        },
    
        {
            "imie": "Jan",
            "wiek": 40,
            "miasto": "Warszawa",
            "pensja": 10_000,
        },
    
        {
            "imie": "Karol",
            "wiek": 23,
            "miasto": "Poznań",
            "pensja": 7_500
        }
    ]
)

df

    imie  wiek    miasto  pensja
0   Anna    20    Kraków    5000
1    Jan    40  Warszawa   10000
2  Karol    23    Poznań    7500

In [14]:
lista = [
    {'imie': 'Anna', 'wiek': 20, 'miasto': 'Kraków', 'pensja': 5000},
    {'imie': 'Jan', 'wiek': 40, 'miasto': 'Warszawa', 'pensja': 10000},
    {'imie': 'Karol', 'wiek': 23, 'miasto': 'Poznań', 'pensja': 7500}
]
lista

[{'imie': 'Anna', 'wiek': 20, 'miasto': 'Kraków', 'pensja': 5000},
 {'imie': 'Jan', 'wiek': 40, 'miasto': 'Warszawa', 'pensja': 10000},
 {'imie': 'Karol', 'wiek': 23, 'miasto': 'Poznań', 'pensja': 7500}]

In [17]:
pd.DataFrame(lista)

    imie  wiek    miasto  pensja
0   Anna    20    Kraków    5000
1    Jan    40  Warszawa   10000
2  Karol    23    Poznań    7500

In [16]:
[  { f"{e}_1" : "e...."  }  for e lin lista_elementow ]

SyntaxError: unterminated string literal (detected at line 1) (1226241449.py, line 1)

In [18]:
df

    imie  wiek    miasto  pensja
0   Anna    20    Kraków    5000
1    Jan    40  Warszawa   10000
2  Karol    23    Poznań    7500

## Zadanie

Uwtórz dataframe z listą osób przypisanych do zespołów - każda osoba ma imię, wiek, zespół (nazwa) do którego należy oraz potrafi programować w jakimś języku.

In [23]:
# rozwiązanie

df = pd.DataFrame(
    {
        "imie": ["Michał", "Iryna", "Jakub", "Tomasz"],
        "wiek": [32, 36, 34, 35],
        "zespol": ["Północ", "Wschód", "Zachód", "Południe"],
        "jezyk": ["Python", "Java", "Pascal", "Basic"]
    }
)
df

     imie  wiek    zespol   jezyk
0  Michał    32    Północ  Python
1   Iryna    36    Wschód    Java
2   Jakub    34    Zachód  Pascal
3  Tomasz    35  Południe   Basic

In [26]:
df.to_csv("dane.csv", index=False)

In [27]:
df_1 = pd.read_csv("dane.csv")
df_1

     imie  wiek    zespol   jezyk
0  Michał    32    Północ  Python
1   Iryna    36    Wschód    Java
2   Jakub    34    Zachód  Pascal
3  Tomasz    35  Południe   Basic

In [28]:
df.to_excel("dane.xlsx", index=False)

ModuleNotFoundError: No module named 'openpyxl'

In [29]:
!pip install openpyxl

Collecting openpyxl
  Downloading openpyxl-3.1.5-py2.py3-none-any.whl (250 kB)
     -------------------------------------- 250.9/250.9 kB 3.8 MB/s eta 0:00:00
Collecting et-xmlfile
  Downloading et_xmlfile-2.0.0-py3-none-any.whl (18 kB)
Installing collected packages: et-xmlfile, openpyxl
Successfully installed et-xmlfile-2.0.0 openpyxl-3.1.5

[notice] A new release of pip available: 22.2.2 -> 25.2
[notice] To update, run: python.exe -m pip install --upgrade pip

In [30]:
df.to_excel("dane.xlsx", index=False)

In [31]:
df_2 = pd.read_excel("dane.xlsx")
df_2

     imie  wiek     zespol       jezyk
0  Michał    32     Północ      Python
1   Iryna    36     Wschód        Java
2   Jakub    34     Zachód      Pascal
3  Tomasz    35   Południe       Basic
4   Józek    45    Szaraki           R
5   Maria    23  Stokrotki  JavaScript